# 1)✅

# 2)
Coke = True
Sprite = False


print(Sprite and Sprite)
print(Coke and Coke)
print(Coke and Sprite)
print(Sprite and Coke)

print(Sprite or Sprite)
print(Coke or Coke)
print(Coke or Sprite)
print(Sprite or Coke)

# 3)
NameSelf = "Deme"
NameInput = input("Please enter your Name:")
AgeInput = input("Please enter your Age:")
HeightInput = input("Please enter your Height:")

print(AgeInput > "18")
print(NameInput == NameSelf)
print(HeightInput > "1.80")

# 4)
# Flowchart-ი გამოიყენება ალგორითმის გამოსახასად ფოტოსურათით,სადაც ნაჩვენებია მუშაობის პროცედურა და შესაძლო გზები.
# Pseudocode(ფსეუდოკოდი)-ი გამოიყენება ალგორითმის აღსაწერად ორივე ინგლისურად და პროგრამულ ენაზე.
# Natural Languange-ი გამოიყენება ალგორითმის აღსაწერად სრულიად ნატურალურ(ბუნებრივ)ენაზე,ძირითადად ინგლისურად.

# 5)
# ალგორითმი არის მუშაობის გზის(ამ შემთხვევაში პროგრამირების) ზუსტი ჩვენება რიგრიგობით,და დალაგებულად.რეალური ცხოვრების მაგალითებია:
# საკვების მომზადების რეცეპტის გამოენების დროს,თუ ავურევთ ალგორითმს,ანუ რეცეპტის მიყოლებას,მივიღებთ სრულიად სხვა შედეგს.
# ადამიანის ცხოვრების დროს,თუ ის პირველად დაიწყებს სკოლას,შემდეგ დაიწყებს სამსახურს,შემდეგ დაიწყებს უნივერსიტეტს და შემდეგ მივა საბავშო ბაღში,დაირღვევა ალგორითმი
# თითის ანაბეჭდის დეტექტირების დროს,პირველად მზადდება სისტემა და კომპონენტები,შემდეგ მომხმარებელი აფიქსირებს თითს,ხოლო შემდეგ მიმდინარეობს ანაბეჭდის შემოწმება.