# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.
numbers = [15 , 7 , 1 , 0 ,5 , 1]
result = 1
for number in numbers:
    result *= number
    print(result)

# 2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.
elements = ["Hello", 12, "60", "125", 7.3, 237, "GOA", 38, "Python", 92]
print(elements[0:8])
# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.
numbers_2 = [6,3,82,2,7]
for i in numbers_2:
    if i < 5:
        print(i)
# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.
numbers_3 = [34, 67, 12, 89, 24, 50, 73, 21, 15, 78]
sum = 0
for i in numbers_3:
    sum += i
    print(sum)
# 5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით.
# Sliceing-ით ჩვენ შეგვიძლია რომ ამოვჭრათ სიის რამდენიმე ელემენტი,და დავბეჭდოთ მხოლოდ ის ან დანარჩენი ელემენტები.