# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემენტი
names = ["Niko", "Trevor", "Franklin", "Michael", "Carl"]
(names.pop(0))
(names.pop(3))
print(names)
# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert()-ამატებს ელემენტს სიის კონკრეტულ ინდექსზე.
# .append()-ამატებს გარკვეულ ელემენტს სიის ბოლოს.
# .pop()-"აგდებს" კონკრეტულ ელემენტს სიიდან.
# .len()-აბრუნებს სიის/სტრინგის გარკვეული ელემენტის სიგრძეს.

# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე

names = ["Niko", "Trevor", "Franklin", "Michael", "Carl"]
names.insert(2,"Dave")
print(names)