# 2) კომენტარის სახით ჩამოწერეთ თუ რა განსხვავებაა set-ებსა და list-ებს შორის.
# list-ებში შეიძლება იყოს განმეორებადი ელემენტები(დუპლიკატები), ხოლო set-ებში დუპლიკატები არ არის.
# list-ებში ელემენტებს წვდომა აქვთ index-ებით, ხოლო set-ებში ინდექსები არ გვაქვს(ელემენტებს ძირითადად in-ებით ვწვდებით)
# 3) შექმენით set სადაც შეინახავთ რიცხვებს, შემდეგ კი ინდექსინგის საშუალებით სცადეთ თითოეული ელემენტის შეცვლა და დააკვირდით შედეგს.
# set = {1, 2, 3, 4}
# set[0] = 10
# print(set) # მივიღებთ ერორს
# 4) შექმენით set, რომელშიც შენახული გექნებათ Fast food საკვები პროდუქტები. შემდეგ კი ამოშალეთ ყველა პირვანდელი ელემენტები set-იდან, და მათ ნაცვლად დაამატეთ ჯანსაღი საკვები პროდუქტები.
# Fast food საკვები პროდუქტები
fast_food = {"Hamburger", "Fries", "Pizza", "Hot Dog"}
fast_food = set()
fast_food = {"Apple", "Carrot", "Salad", "Chicken"}
print(fast_food)
# 5) შექმენით ფუნქცია, რომელიც არგუმენტად იღებს სიას, და აბრუნებს იგივე სიას, მაგრამ დუპლიკატების გარეშე. hint: გააკეთეთ set-ის საშუალებით (output-ში ელემენტების თანმიმდევრობას მნიშვნელობა არ აქვს)
def duplicates_remove(list1):
    return list(set(list1))


