# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით 
def multiply(a, b):
    return a * b
# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.
# isalum()-ამოწმებს თუ მონაცემში მხოლოდ ციფრები და ასოებია,აბრუნებს Boolean მნიშვნელობას(123abc = True; 123,abc=False)
# isdigit()-ამოწმებს თუ მონაცემში მხოლოდ ციფრები(0-9)არის,ასევე აბრუნებს Boolean მნიშვნელობას
# islower()-ამოწმებს თუ მონაცემში მხოლოდ დაბალი შრიფტის მქონე ასოებია,ასევე აბრუნებს Boolean-ს
# isnumeric()-ამოწმებს თუ მონაცემში მხოლოდ ციფრებია(isdigit-ისგან განსხვავების ასევე აღიქვამს სხვა დამწერლობის რიცხვებს,მაგალითად რომაულ რიცხვებს.)
# isupper()-islower-ის მსგავსად ამოწმებს თუ მონაცემში ყველა ასო დიდია
# count()-ითვლის თუ მონაცემში კონკრეტული სიმბოლო რამდენჯერაა მოცემული

# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები
# სიებში,ცვლადებში ან ნებისმიერ მონაცემთა ტიპს ალაგებს რიგობითად(ცუფრული,სიმბოლური,...)
# min() — აბრუნებს ყველაზე პატარა მნიშვნელობას
# max() — აბრუნებს ყველაზე დიდ მნიშვნელობას
